Test1/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

// 1. Les sommets de notre cube (0.1m x 0.1m x 0.01m)
vertices (
    (0 0 0)       // 0
    (0.1 0 0)     // 1
    (0.1 0.1 0)   // 2
    (0 0.1 0)     // 3
    (0 0 0.01)    // 4
    (0.1 0 0.01)  // 5
    (0.1 0.1 0.01)// 6
    (0 0.1 0.01)  // 7
);

// 2. Définition du bloc et du nombre de mailles (50 en X, 50 en Y, 1 en Z)
blocks (
    hex (0 1 2 3 4 5 6 7) (50 50 1) simpleGrading (1 1 1)
);

edges ();

// 3. Définition des parois (Boundaries)
boundary (
    movingWall { type wall; faces ((3 7 6 2)); } // Le couvercle
    fixedWalls { type wall; faces ((0 4 7 3) (2 6 5 1) (1 5 4 0)); } // Côtés et bas
    frontAndBack { type empty; faces ((0 1 2 3) (4 5 6 7)); } // Pour de la 2D
);