Test1/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

// Définition des solveurs pour la pression (p) et la vitesse (U)
solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.05;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }
}

// Paramètres pour le solveur PISO (Pressure Implicit with Splitting of Operators)
PISO { nCorrectors 2; nNonOrthogonalCorrectors 0; pRefCell 0; pRefValue 0; }